package telegram

const (
	startMessage = `Привет! 👋 
Я твой персональный помощник для управления желаниями. 
Вот что я умею:
- 📋 Помогу добавить желания в твой профиль.
- 🔗 Позволю добавить друзей и делиться желаниями.
- 🔒 Ты можешь настроить, будут твои желания публичными или только для друзей.
`

	updateUserMessage = `Отлично! Давай обновим твой профиль. 
Напиши мне свое новое имя! 🖊️`

	createNicknameMessage = `Хочешь выбрать новое имя? 🖊️ 
Просто отправь мне своё желаемое имя, и я обновлю твой профиль!
Например: SuperUser
🚨 Никнейм должен быть уникальным.`

	AddWishMessage = `Напиши мне своё желание! 🎁`

	AddFriendMessage = `Отправь никнейм друга, чтобы добавить его в список! 🤝
Пример: FriendUser
После добавления вы сможете видеть приватные желания друг друга.`

	FriendWishesMessage = `Напиши мне никнейм друга, и я покажу его публичные желания. 🌟
Пример: FriendUser`

	deleteUserMessage = `Вы уверены, что хотите удалить свой профиль? 😟
Это действие необратимо, и все ваши данные будут удалены.

Если вы уверены, нажмите кнопку "Удалить профиль". 
В случае, если передумали, просто вернитесь назад. 😊
🚨 Подумайте дважды перед удалением!`
)
